dict_label_to_num = {
    "퍼" : 0,
    "니트" : 1,
    "무스탕" : 2,
    "레이스" : 3,
    "스웨이드" : 4,
    "린넨" : 5,
    "앙고라" : 6,
    "메시" : 7,
    "코듀로이" : 8,
    "플리스" : 9,
    "시퀸/글리터" : 10,
    "네오프렌" : 11,
    "데님" : 12,
    "실크" : 13,
    "저지" : 14,
    "스판덱스" : 15,
    "트위드" : 16,
    "자카드" : 17,
    "벨벳" : 18,
    "가죽" : 19,
    "비닐/PVC" : 20,
    "면" : 21,
    "울/캐시미어" : 22,
    "시폰" : 23,
    "합성섬유" : 24,
    "우븐" : 25
}

fashion_style_list = [
    '클래식',
    '매니시',
    '페미닌',
    '히피',
    '모던',
    '컨트리',
    '젠더리스',
    '스포티',
    '레트로',
    '밀리터리',
    '프레피',
    '톰보이',
    '로맨틱',
    '웨스턴',
    '소피스트',
    '케이티드',
    '리조트',
    '키치/키덜트',
    '스트리트',
    '섹시',
    '오리엔탈',
    '아방가르드',
    '힙합',
    '펑크'
]

clothes_kind_list = [("아우터", "outer"), ("하의", "pants"), ("원피스", "onepiece"), ("상의", "shirt")]


def label_to_num(fabric:str):
    return dict_label_to_num[fabric]